import React, { FC, useEffect, useRef, useState } from 'react'

interface IWeatherItem {
    date:any;
    tempMax:number;
    tempMin:number;
    description: string;
    iconId: number;
    ind:number;
    visibleModal: (i:number)=>void;
}

export const WeatherItem:FC<IWeatherItem> = ({visibleModal, date, description, tempMax, tempMin, iconId, ind}) => {
    const [widthItem, setWidthItem] = useState<any>(0)

    let dateObj = new Date(date * 1000);
    const mounthArr = ['Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь']
    const daysArr = ['Воскресенье','Понедельник','Вторник','Среда','Четверг','Пятница','Суббота']
    const daysArrShortName = ['Вс','Пн','Вт','Ср','Чт','Пт','Сб']

    let widthItemRef = useRef<HTMLDivElement>(null)
    
    useEffect(()=>{
        setWidthItem(widthItemRef.current?.offsetWidth)
    },[])


    const sun = <svg className='weather__img' id={ind + date} width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path d="M24.0092 35.5016C30.3584 35.5016 35.5055 30.3547 35.5055 24.0058C35.5055 17.6568 30.3584 12.5099 24.0092 12.5099C17.6599 12.5099 12.5128 17.6568 12.5128 24.0058C12.5128 30.3547 17.6599 35.5016 24.0092 35.5016Z" fill="url(#paint0_linear_2_547)"/>
    <path d="M34.8135 2.40051L32.1118 8.92324C31.2312 11.0477 28.0444 9.72795 28.925 7.60352L31.6267 1.08079C32.5073 -1.04363 35.6941 0.276087 34.8135 2.40051ZM19.0727 40.3988L16.371 46.9215C15.4904 49.0459 12.3036 47.7262 13.1842 45.6018L15.8859 39.0791C16.7665 36.9546 19.9533 38.2743 19.0727 40.3988ZM46.9215 16.3748L40.3984 19.0763C38.2739 19.9569 36.9541 16.7703 39.0786 15.8897L45.6017 13.1882C47.7262 12.3076 49.046 15.4942 46.9215 16.3748ZM8.92137 32.1149L2.39833 34.8164C0.273802 35.697 -1.04598 32.5104 1.07855 31.6298L7.60158 28.9283C9.72611 28.0477 11.0459 31.2343 8.92137 32.1149ZM45.6017 34.8187L39.0786 32.1172C36.9541 31.2366 38.2739 28.05 40.3984 28.9306L46.9215 31.6321C49.046 32.5127 47.7262 35.6993 45.6017 34.8187ZM7.60158 19.0786L1.07855 16.3771C-1.04598 15.4965 0.273802 12.3099 2.39833 13.1905L8.92137 15.892C11.0459 16.7726 9.72611 19.9592 7.60158 19.0786ZM16.3687 1.0785L19.0704 7.60122C19.951 9.72565 16.7642 11.0454 15.8836 8.92094L13.1819 2.39821C12.3013 0.273788 15.4881 -1.04593 16.3687 1.0785ZM32.1095 39.0768L34.8112 45.5995C35.6918 47.7239 32.505 49.0436 31.6244 46.9192L28.9227 40.3965C28.0421 38.2721 31.2289 36.9523 32.1095 39.0768Z" fill="#FFB300"/>
    <defs>
    <linearGradient id="paint0_linear_2_547" x1="24.0092" y1="12.5099" x2="24.0092" y2="35.1951" gradientUnits="userSpaceOnUse">
    <stop stopColor="#FFC227"/>
    <stop offset="1" stopColor="#FFB300"/>
    </linearGradient>
    </defs>
    </svg>

    const mainlyCloud = <svg className='weather__img' id={ind + date} width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path opacity="0.32" d="M34 21C37.314 21 40 18.314 40 15C40 11.686 37.314 9 34 9H33.938C33.978 8.672 34 8.338 34 8C34 3.582 30.418 0 26 0C22.5 0 19.524 2.248 18.44 5.378C17.67 5.132 16.852 5 16 5C11.582 5 8 8.582 8 13C8 17.418 11.582 21 16 21C16.69 21 17.36 20.912 18 20.748V21H34Z" fill="#73A5E6"/>
    <path d="M8 31C3.582 31 0 27.418 0 23C0 18.582 3.582 15 8 15C8.834 15 9.636 15.128 10.392 15.364C11.518 11.68 14.946 9 19 9C23.97 9 28 13.03 28 18C28 18.47 27.964 18.93 27.894 19.38C28.55 19.134 29.258 19 30 19C33.314 19 36 21.686 36 25C36 28.314 33.314 31 30 31H8Z" fill="url(#paint0_linear_2_551)"/>
    <path d="M10 18C10 22.97 14.03 27 19 27C23.502 27 27.23 23.696 27.894 19.38C28.55 19.134 29.258 19 30 19C33.314 19 36 21.686 36 25C36 28.314 33.314 31 30 31H8C3.582 31 0 27.418 0 23C0 18.582 3.582 15 8 15C8.834 15 9.636 15.128 10.392 15.364C10.136 16.198 10 17.082 10 18Z" fill="url(#paint1_radial_2_551)"/>
    <defs>
    <linearGradient id="paint0_linear_2_551" x1="18" y1="9" x2="18" y2="31" gradientUnits="userSpaceOnUse">
    <stop stopColor="#9FC7FF"/>
    <stop offset="1" stopColor="#9BC1F5"/>
    </linearGradient>
    <radialGradient id="paint1_radial_2_551" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(13.9439 -29.6966) rotate(-90) scale(20.9574 6.69705)">
    <stop stopColor="#486DA8" stopOpacity="0.4"/>
    <stop offset="1" stopColor="#486DA8" stopOpacity="0"/>
    </radialGradient>
    </defs>
    </svg>

    const rain = <svg className='weather__img' id={ind + date} width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
       <path d="M8.21798 26.926L6.11798 31.924C5.79798 32.688 6.15598 33.568 6.91998 33.888C7.68398 34.208 8.56398 33.85 8.88398 33.086L10.984 28.088C11.304 27.324 10.946 26.444 10.182 26.124C9.41798 25.804 8.53798 26.162 8.21798 26.926ZM24.218 26.926L22.118 31.924C21.798 32.688 22.156 33.568 22.92 33.888C23.684 34.208 24.564 33.85 24.884 33.086L26.984 28.088C27.304 27.324 26.946 26.444 26.182 26.124C25.418 25.804 24.538 26.162 24.218 26.926ZM16.218 24.926L14.118 29.924C13.798 30.688 14.156 31.568 14.92 31.888C15.684 32.208 16.564 31.85 16.884 31.086L18.984 26.088C19.304 25.324 18.946 24.444 18.182 24.124C17.418 23.804 16.538 24.162 16.218 24.926Z" fill="#66AFEB"/>
       <path d="M8 22C3.582 22 0 18.418 0 14C0 9.582 3.582 6 8 6C8.834 6 9.636 6.128 10.392 6.364C11.518 2.68 14.946 0 19 0C23.97 0 28 4.03 28 9C28 9.47 27.964 9.93 27.894 10.38C28.55 10.134 29.258 10 30 10C33.314 10 36 12.686 36 16C36 19.314 33.314 22 30 22H8Z" fill="url(#paint0_linear_2_526)"/>
       <path d="M10 9C10 13.97 14.03 18 19 18C23.502 18 27.23 14.696 27.894 10.38C28.55 10.134 29.258 10 30 10C33.314 10 36 12.686 36 16C36 19.314 33.314 22 30 22H8C3.582 22 0 18.418 0 14C0 9.582 3.582 6 8 6C8.834 6 9.636 6.128 10.392 6.364C10.136 7.198 10 8.082 10 9Z" fill="url(#paint1_radial_2_526)"/>
       <defs>
       <linearGradient id="paint0_linear_2_526" x1="18" y1="0" x2="18" y2="22" gradientUnits="userSpaceOnUse">
       <stop stopColor="#9FC7FF"/>
       <stop offset="1" stopColor="#9BC1F5"/>
       </linearGradient>
       <radialGradient id="paint1_radial_2_526" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(4.75395 -30.6966) rotate(-90) scale(20.9574 6.69705)">
       <stop stopColor="#486DA8" stopOpacity="0.4"/>
       <stop offset="1" stopColor="#486DA8" stopOpacity="0"/>
       </radialGradient>
       </defs>
    </svg>
   
    const smallRainSun = <svg className='weather__img' id={ind + date} width="48" height="48" viewBox="0 0 48 48" xmlns="http://www.w3.org/2000/svg">
    <path d="M28 24C32.4183 24 36 20.4183 36 16C36 11.5817 32.4183 8 28 8C23.5817 8 20 11.5817 20 16C20 20.4183 23.5817 24 28 24Z" fill="url(#paint0_linear_2_531)"/>
    <path d="M26.96 1.45999L27.48 4.41399C27.828 6.38399 24.872 6.90399 24.526 4.93399L24.006 1.97999C23.658 0.00998566 26.614 -0.510014 26.96 1.45999V1.45999ZM37.546 4.98199L35.826 7.43999C34.678 9.07799 32.222 7.35799 33.368 5.71999L35.088 3.26199C36.236 1.62399 38.692 3.34399 37.546 4.98199ZM16.984 6.45399L19.442 8.17399C21.08 9.32199 19.36 11.778 17.722 10.632L15.264 8.91199C13.626 7.76399 15.346 5.30799 16.984 6.45399V6.45399ZM38.282 21.366L40.74 23.086C42.378 24.234 40.658 26.69 39.02 25.544L36.562 23.824C34.924 22.676 36.644 20.22 38.282 21.366ZM42.542 14.958L39.588 15.478C37.618 15.826 37.098 12.87 39.068 12.524L42.022 12.004C43.992 11.656 44.512 14.612 42.542 14.958Z" fill="#FFB300"/>
    <path d="M10.218 38.926L8.11798 43.924C7.79798 44.688 8.15598 45.568 8.91998 45.888C9.68398 46.208 10.564 45.85 10.884 45.086L12.984 40.088C13.304 39.324 12.946 38.444 12.182 38.124C11.418 37.804 10.538 38.162 10.218 38.926V38.926ZM20.218 36.926L18.118 41.924C17.798 42.688 18.156 43.568 18.92 43.888C19.684 44.208 20.564 43.85 20.884 43.086L22.984 38.088C23.304 37.324 22.946 36.444 22.182 36.124C21.418 35.804 20.538 36.162 20.218 36.926Z" fill="#66AFEB"/>
    <path d="M8 34C3.582 34 0 30.418 0 26C0 21.582 3.582 18 8 18C8.834 18 9.636 18.128 10.392 18.364C11.518 14.68 14.946 12 19 12C23.97 12 28 16.03 28 21C28 21.47 27.964 21.93 27.894 22.38C28.55 22.134 29.258 22 30 22C33.314 22 36 24.686 36 28C36 31.314 33.314 34 30 34H8Z" fill="url(#paint1_linear_2_531)"/>
    <path d="M10 21C10 25.97 14.03 30 19 30C23.502 30 27.23 26.696 27.894 22.38C28.55 22.134 29.258 22 30 22C33.314 22 36 24.686 36 28C36 31.314 33.314 34 30 34H8C3.582 34 0 30.418 0 26C0 21.582 3.582 18 8 18C8.834 18 9.636 18.128 10.392 18.364C10.136 19.198 10 20.082 10 21Z" fill="url(#paint2_radial_2_531)"/>
    <defs>
    <linearGradient id="paint0_linear_2_531" x1="36" y1="8" x2="24.7832" y2="19.0723" gradientUnits="userSpaceOnUse">
    <stop stopColor="#FFB301"/>
    <stop offset="1" stopColor="#FFC533"/>
    </linearGradient>
    <linearGradient id="paint1_linear_2_531" x1="18" y1="12" x2="18" y2="34" gradientUnits="userSpaceOnUse">
    <stop stopColor="#9FC7FF"/>
    <stop offset="1" stopColor="#9BC1F5"/>
    </linearGradient>
    <radialGradient id="paint2_radial_2_531" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(11.0679 -22.6966) rotate(-90) scale(20.9574 6.69705)">
    <stop stopColor="#486DA8" stopOpacity="0.4"/>
    <stop offset="1" stopColor="#486DA8" stopOpacity="0"/>
    </radialGradient>
    </defs>
    </svg>
   
    // const smallRain = <svg className='weather__img' id={ind + date} width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
    //    <path d="M28 24C32.4183 24 36 20.4183 36 16C36 11.5817 32.4183 8 28 8C23.5817 8 20 11.5817 20 16C20 20.4183 23.5817 24 28 24Z" fill="url(#paint0_linear_2_531)"/>
    //    <path d="M26.96 1.45999L27.48 4.41399C27.828 6.38399 24.872 6.90399 24.526 4.93399L24.006 1.97999C23.658 0.00998566 26.614 -0.510014 26.96 1.45999ZM37.546 4.98199L35.826 7.43999C34.678 9.07799 32.222 7.35799 33.368 5.71999L35.088 3.26199C36.236 1.62399 38.692 3.34399 37.546 4.98199ZM16.984 6.45399L19.442 8.17399C21.08 9.32199 19.36 11.778 17.722 10.632L15.264 8.91199C13.626 7.76399 15.346 5.30799 16.984 6.45399ZM38.282 21.366L40.74 23.086C42.378 24.234 40.658 26.69 39.02 25.544L36.562 23.824C34.924 22.676 36.644 20.22 38.282 21.366ZM42.542 14.958L39.588 15.478C37.618 15.826 37.098 12.87 39.068 12.524L42.022 12.004C43.992 11.656 44.512 14.612 42.542 14.958Z" fill="#FFB300"/>
    //    <path d="M10.218 38.926L8.11798 43.924C7.79798 44.688 8.15598 45.568 8.91998 45.888C9.68398 46.208 10.564 45.85 10.884 45.086L12.984 40.088C13.304 39.324 12.946 38.444 12.182 38.124C11.418 37.804 10.538 38.162 10.218 38.926ZM20.218 36.926L18.118 41.924C17.798 42.688 18.156 43.568 18.92 43.888C19.684 44.208 20.564 43.85 20.884 43.086L22.984 38.088C23.304 37.324 22.946 36.444 22.182 36.124C21.418 35.804 20.538 36.162 20.218 36.926Z" fill="#66AFEB"/>
    //    <path d="M8 34C3.582 34 0 30.418 0 26C0 21.582 3.582 18 8 18C8.834 18 9.636 18.128 10.392 18.364C11.518 14.68 14.946 12 19 12C23.97 12 28 16.03 28 21C28 21.47 27.964 21.93 27.894 22.38C28.55 22.134 29.258 22 30 22C33.314 22 36 24.686 36 28C36 31.314 33.314 34 30 34H8Z" fill="url(#paint1_linear_2_531)"/>
    //    <path d="M10 21C10 25.97 14.03 30 19 30C23.502 30 27.23 26.696 27.894 22.38C28.55 22.134 29.258 22 30 22C33.314 22 36 24.686 36 28C36 31.314 33.314 34 30 34H8C3.582 34 0 30.418 0 26C0 21.582 3.582 18 8 18C8.834 18 9.636 18.128 10.392 18.364C10.136 19.198 10 20.082 10 21Z" fill="url(#paint2_radial_2_531)"/>
    //    <defs>
    //    <linearGradient id="paint0_linear_2_531" x1="36" y1="8" x2="24.7832" y2="19.0723" gradientUnits="userSpaceOnUse">
    //    <stop stopColor="#FFB301"/>
    //    <stop offset="1" stopColor="#FFC533"/>
    //    </linearGradient>
    //    <linearGradient id="paint1_linear_2_531" x1="18" y1="12" x2="18" y2="34" gradientUnits="userSpaceOnUse">
    //    <stop stopColor="#9FC7FF"/>
    //    <stop offset="1" stopColor="#9BC1F5"/>
    //    </linearGradient>
    //    <radialGradient id="paint2_radial_2_531" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(11.0679 -22.6966) rotate(-90) scale(20.9574 6.69705)">
    //    <stop stopColor="#486DA8" stopOpacity="0.4"/>
    //    <stop offset="1" stopColor="#486DA8" stopOpacity="0"/>
    //    </radialGradient>
    //    </defs>
    // </svg>

    const snow = <svg className='weather__show-img weather__img' viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" ><defs><linearGradient id="a" x1="50%" x2="50%" y1="0%" y2="100%"><stop offset="0%" stopColor="#9FC7FF"/><stop offset="100%" stopColor="#9BC1F5"/></linearGradient><radialGradient id="b" cx="55.585%" cy="10.083%" r="58.215%" fx="55.585%" fy="10.083%" gradientTransform="matrix(0 -1 .719 0 .483 .657)"><stop offset="0%" stopColor="#486DA8" stopOpacity=".4"/><stop offset="100%" stopColor="#486DA8" stopOpacity="0"/></radialGradient></defs><g fill="none"><path fill="#67C8E2" fillRule="nonzero" d="M12.125 18.417l.682-.394c.722-.417 1.347.666.625 1.083l-.682.394.682.394c.722.417.097 1.499-.625 1.083l-.682-.394v.787c0 .345-.28.625-.625.625s-.625-.28-.625-.625v-.787l-.682.394c-.722.417-1.347-.666-.625-1.083l.682-.394-.682-.394c-.722-.417-.097-1.499.625-1.083l.682.394v-.787c0-.345.28-.625.625-.625s.625.28.625.625v.787zm6-2l.682-.394c.722-.417 1.347.666.625 1.083l-.682.394.682.394c.722.417.097 1.499-.625 1.083l-.682-.394v.787c0 .345-.28.625-.625.625s-.625-.28-.625-.625v-.787l-.682.394c-.722.417-1.347-.666-.625-1.083l.682-.394-.682-.394c-.722-.417-.097-1.499.625-1.083l.682.394v-.787c0-.345.28-.625.625-.625s.625.28.625.625v.787zm-12 0l.682-.394c.722-.417 1.347.666.625 1.083l-.682.394.682.394c.722.417.097 1.499-.625 1.083l-.682-.394v.787c0 .345-.28.625-.625.625s-.625-.28-.625-.625v-.787l-.682.394c-.722.417-1.347-.666-.625-1.083l.682-.394-.682-.394c-.722-.417-.097-1.499.625-1.083l.682.394v-.787c0-.345.28-.625.625-.625s.625.28.625.625v.787z"/><path fill="url(#a)" d="M7 14c-2.209 0-4-1.791-4-4s1.791-4 4-4c.417 0 .818.064 1.196.182.563-1.842 2.277-3.182 4.304-3.182 2.485 0 4.5 2.015 4.5 4.5 0 .235-.018.465-.053.69.328-.123.682-.19 1.053-.19 1.657 0 3 1.343 3 3s-1.343 3-3 3h-11z"/><path fill="url(#b)" d="M8 7.5c0 2.485 2.015 4.5 4.5 4.5 2.251 0 4.115-1.652 4.447-3.81.328-.123.682-.19 1.053-.19 1.657 0 3 1.343 3 3s-1.343 3-3 3h-11c-2.209 0-4-1.791-4-4s1.791-4 4-4c.417 0 .818.064 1.196.182-.128.417-.196.859-.196 1.318z"/></g></svg>

  return (
    <div onClick={()=>visibleModal(ind)} className='weather-item' ref={widthItemRef}>
        <p className='title-text'>{widthItem <= 113 || widthItem === 130 ? daysArrShortName[dateObj.getDay()] : daysArr[dateObj.getDay()]}</p>
        <p className='subtitle-text--gray'>{`${dateObj.getDate()} ${mounthArr[dateObj.getMonth()].slice(0,3).toLowerCase()}`}</p>
        {iconId >= 200 && iconId <= 321 ? rain : iconId >= 500 && iconId <= 504 ? smallRainSun : iconId > 504 && iconId <= 531 ? rain : iconId >= 600 && iconId <= 622 ? snow : iconId > 700  && iconId < 800 ? mainlyCloud : iconId === 800  && iconId < 801 ? sun : iconId >= 801 ? mainlyCloud : null}
        <p className='title-text'>{Math.round(tempMax)}°</p>
        <p className='small-text--gray'>{Math.round(tempMin)}°</p>
        <p className='small-text--gray'>{description}</p>
    </div>
  )
}
